{
    "selectLanguage": "Please select your language:",
    "Your language has been updated successfully!": "Your language has been updated successfully!",
    "mainInfo": "<b>Welcome to TeleSwap Bot! 🚀</b>\n\n    - Total Users: <b>{{totalUsers}}</b>\n    - Total Exchanges: <b>{{totalExchanges}}</b>\n    - Total Volume: <b>{{totalVolume}}</b> USD\n    - Total Rev Share: <b>{{totalRevShare}}</b> USD\n\nUse the following commands:\n\n    - /start: <i>View bot information</i>\n    - /run: <i>Start the app</i>\n    - /referral: <i>Get your referral link</i>\n    - /update_address: <i>Update your TON coin address</i>\n    - /update_language: <i>Update your preferred language</i>\n    - /support: <i>Support exchanging</i>\n    - /help: <i>Help how to use TeleSwap bot</i>",
    "referralInfo": "Total Referred Users: <b>{{TotalReferrals}}</b>\nTotal Referral Volume: <b>{{TotalVolume}}</b> USD\nTotal Referral Rewards: <b>{{TotalRewards}}</b> USD\n\nMy Referred Users: <b>{{MyReferrals}}</b>\nMy Referral Volume: <b>{{MyVolume}}</b> USD\nMy Referral Rewards: <b>{{MyRewards}}</b> USD\n\nShare this link to refer others: {{referralLink}}",
    "welcomeMessage": "Hello {{username}}! Thank you for reaching out for support. To assist you better, could you please provide us with your exchange ID? It should be in your recent messages from TeleSwap. This will allow us to take a closer look at your swap and help resolve your issue as quickly as possible.",
    "waitingMessage": "Great, thank you. It looks like your swap is still waiting for {{fromCurrency}} to be deposited. If You have already sent the {{fromCurrency}} and it is not showing up yet, please allow a few minutes as it can take some time to detect the transaction! The deposit time can vary depending on the blockchain. If You are experiencing wait times longer than 45 minutes for Your sent tokens to be deposited, please contact @TeleSwapSupport.",
    "confirmingMessage": "Thank you for your exchange ID. Looking into your swap, I can see the <b>{{fromCurrency}}</b> has been deposited. We are now confirming your deposit! This means your swap is moving along nicely and you can relax and wait for your tokens! If your tokens have been confirming for over 45 minutes, please contact @TeleSwapSupport and we will take a closer look for you. Here is the input transaction confirming your <b>{{fromCurrency}}</b> has been deposited.\n<b>{{hash_from}}</b>\nI hope this helps, thank you for reaching out to TeleSwap support.",
    "exchangingMessage": "Thank you for your exchange ID. Looking into your swap, I can see the <b>{{fromCurrency}}</b> has been deposited. Your <b>{{fromCurrency}}</b> is currently being swapped for <b>{{toCurrency}}</b>! Please allow us some time as exchange times vary depending on the blockchain and swap size. If you are experiencing an exchange taking over 1.5 hours, please contact @TeleSwapSupport and we will take a closer look. I hope this helps, thank you for reaching out to TeleSwap support!",
    "sendingMessage": "Thank you for your exchange ID. Looking into your swap, I can see <b>{{fromCurrency}}</b> has been swapped for <b>{{toCurrency}}</b>. Your <b>{{toCurrency}}</b> is currently being sent to DepositWallet, the wallet you set as the recipient address. Please allow a few moments, as sending the tokens can vary depending on the blockchain being used. Your tokens are on the way! I hope this helps, thank you for reaching out to TeleSwap support!",
    "finishedMessage": "Thank you for your exchange ID. Looking into your swap, I can see <b>{{fromCurrency}}</b> has been swapped for <b>{{toCurrency}}</b>. The swap has been completed and your <b>{{toCurrency}}</b> has been sent to DepositWallet, the wallet you set as the recipient address. Here is the output transaction confirming the <b>{{toCurrency}}</b> was sent to the wallet you provided us.\n<b>{{hash_to}}</b>\nThank you for using TeleSwap!",
    "helpMessage": "<b>How to use TeleSwap Bot:</b>\n\n1. <b>/start:</b> Begin using the bot and get an overview.\n2. <b>/run:</b> Launch the app and start interacting.\n3. <b>/referral:</b> Get your unique referral link to share.\n4. <b>/update_address:</b> Provide or update your TON coin address.\n5. <b>/update_language:</b> Provide or update your preferred language.\n6. <b>/support:</b> Support exchanging.\n\nNeed more help? Contact @TeleSwapSupport or <a href=\"https://teleswap.io/\">visit our website</a>."
  }